      ******************************************************************
      * Author: Eugy Enoch
      * Date: 16th May 2019
      * Purpose: To say Hello world in COBOL
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GREETING.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM GREETING.
